#################################
#변수 선언
#################################
a <- 1
b <- 2
c <- 3; d <- 4; e <- 5

#################################
#사칙 연산
#################################
a + b
a - b
a * b
a / b
b ^ 2
b ** 2

#################################
#벡터 생성
#################################
x <- c(1,2,3)
y <- c(4,5,6)

#################################
#벡터 연산
#################################
x + y
# [1] 5 7 9

x - y
# [1] -3 -3 -3

x * y
# [1]  4 10 18

x / y
# [1] 0.25 0.40 0.50

x^2 #제곱
# [1] 1 4 9

x**2 #제곱
# [1] 1 4 9

log(x^2)
# [1] 0.0000000 0.6931472 1.0986123

z <- c(x, y)
z
# [1] 1 2 3 4 5 6

1/0 #무한대
# [1] Inf

log(-1) #이상치(Not a Number)
# [1] NaN

x <- c(7,2,4,9,8,6,1,5,10,3)
sort(x) #정렬-오름차순
# [1]  1  2  3  4  5  6  7  8  9 10

sort(x, decreasing = TRUE) #정렬-내림차순
# [1] 10  9  8  7  6  5  4  3  2  1

sum(x)
# [1] 55

mean(x) #평균
# [1] 5.5

sum(x)/length(x) #평균
# [1] 5.5

var(x) #분산
# [1] 9.166667

min(x) #최소값
# [1] 1

which.min(x) #최소값의 위치
# [1] 7

summary(x) #기초 통계량
# Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
# 1.00    3.25    5.50    5.50    7.75   10.00

y <- c(1, 3, 5, NA, 9, NA, 11)

mean(y) #NA가 포함된 평균
# [1] NA

mean(y, na.rm = TRUE) #NA를 제외한 평균
# [1] 5.8

is.na(y) #각 관측치가 NA인지 여부 판단
# [1] FALSE FALSE FALSE  TRUE FALSE  TRUE FALSE

!is.na(y) #각 관측치가 NA가 아닌지 여부 판단
# [1]  TRUE  TRUE  TRUE FALSE  TRUE FALSE  TRUE

which(is.na(y)) #NA인 관측치의 위치
# [1] 4 6

sum(is.na(y)) #관측치가 NA인지 여부 판단 -> TRUE=1, FALSE=0 -> 합계
# [1] 2

#################################
#문서 검색
#################################
#문서 시작페이지
help.start()

#함수 문서
help(mean)
?mean 

#문서 키워드 검색
help.search("mean")
??mean

example(mean) #예제
# mean> x <- c(0:10, 50)
# mean> xm <- mean(x)
# mean> c(xm, mean(x, trim = 0.10))
# [1] 8.75 5.50